// 26. Напишите программу, которая принимает на вход число и выдает количество цифр в числе.
Console.WriteLine("Программу, которая принимает на вход число и выдает количество цифр в числе.");

