'''

Методы сбора и обработки данных из сети Интернет
Урок 8. Работа с данными

Парсинг Instagram

    Написать приложение, которое будет проходиться по указанному списку(делать через ввод input) двух и/или более
    пользователей и собирать данные об их подписчиках и подписках. По каждому пользователю, который является
    подписчиком или на которого подписан исследуемый объект нужно извлечь имя, id, фото (остальные данные по
    желанию). Фото можно дополнительно скачать(необязательно). Собранные данные необходимо сложить в базу данных.
    Структуру данных нужно заранее продумать(!), чтобы: Написать функцию, которая будет делать запрос к базе,
    который вернет список подписчиков только указанного пользователя Написать функцию, которая будет делать запрос к
    базе, который вернет список профилей, на кого подписан указанный пользователь

    Можете сделать 8 дз с сайтом https://vc.ru/ , чтобы не тратить время на обход блокировок
    Но нужно будет его чуть больше изучить
    Можете посмотреть пример работы с ним тут - https://github.com/nizhikebinesi/web_scraping_14_04_2022/tree/lesson_8

'''