// 54. Задайте двумерный массив. Напишите программу, которая упорядочит по убыванию элементы каждой строки двумерного массива.
Console.WriteLine("Программа упорядочит по убыванию элементы каждой строки двумерного массива.");

int[,] GenArray()
{
    Console.Write("Введите число строк массива m: ");
    int m = int.Parse(Console.ReadLine ());
    Console.Write("Введите число столбцов массива n: ");
    int n = int.Parse(Console.ReadLine ());
    int[,] arr = new int[m, n];
    Random rand = new Random();

    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            arr[i, j] = rand.Next(10);
        }

    }
    return arr;
}

void PrintArray(int[,] prarr)
{
    for (int i = 0; i < prarr.GetLength(0); i++)
    {
        for (int j = 0; j < prarr.GetLength(1); j++)
        {
            Console.Write(prarr[i,j] + " ");
        }
        Console.WriteLine();
    }
}

void DecreaseRowArray(int[,] arr)
{
    int[] rowarr = new int[arr.GetLength(1)];
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        for (int j = 0; j < arr.GetLength(1); j++)
            rowarr[j] = arr[i,j];
        Array.Sort(rowarr);
        Array.Reverse(rowarr);
        for (int k = 0; k < arr.GetLength(1); k++)
            arr[i,k] = rowarr[k];
    }
}

int[,] arr = GenArray();
PrintArray(arr);
Console.WriteLine();
DecreaseRowArray(arr);
PrintArray(arr);