/**
 * Написать программу, показывающую последовательность действий для игры “Ханойская башня”
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Программа показывает последовательность действий для игры “Ханойская башня");
    }
}