/**
 * Написать программу, показывающую последовательность действий для игры “Ханойская башня”
 * Ханойская башня является одной из популярных головоломок XIX века.
 * Даны три стержня, на один из которых нанизаны восемь колец, причём кольца отличаются размером и лежат меньшее на большем.
 * Задача состоит в том, чтобы перенести пирамиду из восьми колец за наименьшее число ходов на другой стержень.
 * За один раз разрешается переносить только одно кольцо, причём нельзя класть большее кольцо на меньшее.
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Программа показывает последовательность действий для игры “Ханойская башня");
    }
}